waveshareteam/ESP32-S3-Touch-LCD-7C/example/esp-idf/09_SPEAKER_MICROPHONE/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_IDF_EXPERIMENTAL_FEATURES=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_FETCH_INSTRUCTIONS=y
CONFIG_SPIRAM_RODATA=y

CONFIG_FREERTOS_HZ=1000
CONFIG_ESP32S3_DATA_CACHE_LINE_64B=y
CONFIG_COMPILER_OPTIMIZATION_PERF=y

CONFIG_FATFS_LFN_HEAP=y
CONFIG_CODEC_ES8311_SUPPORT=y
CONFIG_CODEC_ES7210_SUPPORT=y
CONFIG_CODEC_ES7243_SUPPORT =n
CONFIG_CODEC_ES7243E_SUPPORT =n
CONFIG_CODEC_ES8156_SUPPORT =n
CONFIG_CODEC_AW88298_SUPPORT =n
CONFIG_CODEC_ES8389_SUPPORT =n
CONFIG_CODEC_ES8374_SUPPORT =n
CONFIG_CODEC_ES8388_SUPPORT =n
CONFIG_CODEC_TAS5805M_SUPPORT =n
CONFIG_CODEC_ZL38063_SUPPORT =n
CONFIG_CODEC_CJC8910_SUPPORT =n